protogia/avr-descriptionfiles-4-nim/svd/ATmega16HVB.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FET</name>
      <description>FET Control</description>
      <baseAddress>0x000000F0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FCSR</name>
          <description>FET Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFE</name>
              <description>Charge FET Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE</name>
              <description>Discharge FET Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPS</name>
              <description>Current Protection Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUVRD</name>
              <description>Deep Under-Voltage Recovery Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOTRST</name>
              <description>Boot Reset vector Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTSZ</name>
              <description>Select Boot Size</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2048W_1800</name>
                  <description>Boot Flash size=2048 words Boot address=$1800</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024W_1C00</name>
                  <description>Boot Flash size=1024 words Boot address=$1C00</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512W_1E00</name>
                  <description>Boot Flash size=512 words Boot address=$1E00</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256W_1F00</name>
                  <description>Boot Flash size=256 words Boot address=$1F00</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Clock Divide mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCSEL</name>
              <description>Oscillator select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUT</name>
              <description>Select start-up time</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>14CK_4MS</name>
                  <description>Start-up time 14 CK + 4 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_8MS</name>
                  <description>Start-up time 14 CK + 8 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_16MS</name>
                  <description>Start-up time 14 CK + 16 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_32MS</name>
                  <description>Start-up time 14 CK + 32 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_64MS</name>
                  <description>Start-up time 14 CK + 64 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_128MS</name>
                  <description>Start-up time 14 CK + 128 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_256MS</name>
                  <description>Start-up time 14 CK + 256 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_512MS</name>
                  <description>Start-up time 14 CK + 512 ms</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
